{
  "data": [
    {
      "id": "asdg3425b=",
      "name": "MeraID",
      "url": "https://www.meraid.pk",
      "description": "In this project I started working on the mobile application's frontend using Flutter. Then I switched to the backend where all the fun happened. I have used NodeJS, Serverless Framework, and AWS Lambda for APIs. For the database solution we went with the DynamoDB a NoSQL database provided by AWS. I have also worked on the authentication of this solution, and our authentication solution was so successful that we have no fake users in our system. The auth system uses passkey protected user's private communication key to facial \"rekognition\" and \"Indexing Faces\" for later confirmation. All communication to and from the API were protected with AES-256 + RSA-2048 over HTTPs protocol, \"Textract\" was also utilized to scan and read information from the CNIC on the server.",
      "logo": "meraid",
      "technologies": [
        "NodeJS",
        "DynamoDB",
        "Flutter",
        "AWS Lambda",
        "AWS Rekognition",
        "AWS Textract",
        "NodeCrypto",
        "Serverless",
        "AWS S3"
      ]
    },
    {
      "logo": "chess",
      "id": "MDEwOlJlcG9zaXRvcnkxODIxMjk3rtNTQ=",
      "name": "Shaoor.Tech",
      "url": "https://www.shaoor.tech",
      "description": "Shaoor.tech was a pet application developed using VUE JS as an SPA(Single Page Application), for the backend services I started with ExpressJS and the switched Microsoft Azure Serverless Functions were used with MongoDB as the database solution.",
      "technologies": [
        "NodeJS",
        "ExpressJS",
        "VUE.JS",
        "MongoDB",
        "Microsoft Azure",
        "TailwindCSS"
      ]
    },
    {
      "logo": "broken-image",
      "id": "sasga=",
      "name": "Mavencery",
      "url": "http://mavencery.com/",
      "description": "Mavencery was an upcoming Grocer Giant registered in California, in this project my primary role was backend development. I started working on this project in between my internship and my graduation. I have used NodeJS, ExpressJS, and MySQL as database solution, I got exposure to Sequelize ORM in this project.",
      "technologies": [
        "NodeJS",
        "ExpressJS",
        "MySQL",
        "Sequelize",
        "Firebase",
        "Heroku",
        "Flutter"
      ]
    },
    {
      "logo": "fooddo",
      "id": "MDEwOlJlcG9zaXRvcnkyNDU0NjcyNzQ=",
      "name": "Fooddo",
      "url": "https://github.com/UmairJibran/Fooddo",
      "description": "A project aimed at reducing food waste from banquets and houses, by sharing it with the deserving people.",
      "technologies": ["flutter", "dart", "firebase", "google maps"]
    },
    {
      "logo": "auction",
      "id": "MDEwOlJlcG9zaXRvcnkxNTU5NTE3NTk=",
      "name": "eAuction",
      "url": "https://github.com/UmairJibran/online-Auction",
      "description": "eAuction was a semester project that went beyond my and the professor's expectations, it started as a simple HTML website but adding features like manual Authentication, and time control for each auction item kept making it a more complex project. I started with HTML and CSS, then switched to Bootstrap as styling framework, and sticked to PHP and MySQL for the backend.",
      "technologies": ["PHP", "SQL", "HTML", "CSS"]
    },
    {
      "logo": "lms",
      "id": "MDEwOlJlcG9zaXRvcnkyNzM1MTI1NTE=",
      "name": "City University LMS",
      "url": "https://github.com/UmairJibran/cu-lms",
      "description": "It was a pet project still in development, uses flutter for client side and NodeJS MySQL for the backend.",
      "technologies": ["NodeJS", "MySQL", "flutter"]
    },
    {
      "name": "Perceptron",
      "id": "MDEwOlJlcGsagXRvcnkyNzM1MTI1NTE=",
      "logo": "ai",
      "url": "https://github.com/umairjibran/Simple-Perceptron",
      "description": "Perceptron Algorithm implemented in C++",
      "technologies": ["C++"]
    },
    {
      "id": "MDEwOlJlcG9zaXRvcnkyNjkwNzUwMjM=",
      "name": "Counter Application",
      "logo": "counter",
      "url": "https://github.com/umairjibran/basic-flutter-counter",
      "description": "A counter application in flutter that we could use to keep count of whatever we wanted, it can be simply laps of a race or moves that were made in a game.",
      "technologies": ["Flutter", "Dart"]
    }
  ]
}
