[
  {
    "company": "PuppyDog.io",
    "website": "https://www.puppydog.io",
    "position": "Software Engineer",
    "startDate": "2025-06-16",
    "endDate": null,
    "oneLine": "Early engineer at PuppyDog.io building custom models and LLM-powered features.",
    "bullets": [
      "Led migration of AI infrastructure from AWS to GCP.",
      "Spearheaded CRM integrations with external partners.",
      "Built agentic LLM workflows to automate complex processes."
    ],
    "volunteer": false
  },
  {
    "company": "IM Sciences",
    "website": "https://www.imsciences.edu.pk",
    "position": "Corporate Advisor",
    "startDate": "2024-08-12",
    "endDate": null,
    "oneLine": "Corporate board advisor bringing industry perspective to modernize curriculum and strategy.",
    "bullets": [
      "Partnered with industry leaders to provide strategic guidance to IMSciences.",
      "Revamped curriculum to align graduate skills with market needs and employer expectations."
    ],
    "volunteer": true
  },
  {
    "company": "Productbox",
    "website": "https://www.productbox.dev",
    "position": "Full stack engineer",
    "startDate": "2021-05-03",
    "endDate": "2025-06-15",
    "oneLine": "Full-stack engineer at Productbox driving backend architecture and scalable applications.",
    "bullets": [
      "Led backend architecture and scaling using Node.js and Serverless.",
      "Built secure, high-performance REST APIs and full-stack features.",
      "Improved app robustness and scalability with Node, React, Serverless, and AlpineJS.",
      "Coordinated cross-functional teams and delivered products using Agile.",
      "Worked across MySQL, Express, Firebase Auth, OpenCV, Flutter, and Git workflows."
    ],
    "volunteer": false
  },
  {
    "company": "Microsoft",
    "website": "https://www.microsoft.com",
    "position": "Student Ambassador",
    "startDate": "2020-08-12",
    "endDate": "2021-12-16",
    "oneLine": "Microsoft Student Ambassador promoting technology adoption and empowering students.",
    "bullets": [
      "Delivered hands-on trainings on Azure, Power BI, GitHub, and Figma.",
      "Mentored student projects to build practical solutions with Microsoft tech.",
      "Grew campus adoption through partnerships with student orgs and faculty.",
      "Produced tutorials and content to make tools accessible to a wider audience.",
      "Served as a liaison between Microsoft and the academic community."
    ],
    "volunteer": true
  },
  {
    "company": "Ideometrix",
    "website": "https://www.ideometrix.com",
    "position": "Junior Mobile Developer",
    "startDate": "2020-08-15",
    "endDate": "2020-11-15",
    "oneLine": "Junior Flutter developer intern building cross-platform apps and mentoring juniors.",
    "bullets": [
      "Taught Flutter fundamentals and mentored a cohort of junior developers.",
      "Designed and delivered a hands-on training curriculum with projects.",
      "Implemented cross-platform mobile features using Flutter.",
      "Enforced coding best practices through code reviews."
    ],
    "volunteer": false
  }
]
